using System;
using System.Collections.Generic;
using UnityEngine;

namespace UServer3
{
    public class Settings
    {
        #region [Settings] Connection
        
        // SteamID и OwnerID подключения до игрового сервера
        public static UInt64 Connection1_SteamID = 76561197960279927;
        
        // Username подключения до игрового сервера
        public static String Connection1_Username = "garry";
        
        // SteamID и OwnerID подключения до игрового клиента
        public static UInt64 Connection2_SteamID = 76561198240345356;
        
        // Username подключения до игрового клиента
        public static String Connection2_Username = "Alistair";
        
        // IP Сервера к которому будет происходить коннект
        public static String TargetServer_IP = "127.0.0.1";
        
        // Port Сервера к которому будет происходить коннект:
        public static Int32 TargetServer_Port = 28015; //12000

        #endregion

        #region [Settings] Aimbot Range
        
        // При попадании в статический объект, чит ищет оптимальную цель, засщитывает то попадание по ней
        public static bool Aimbot_Range_Silent = true;
        
        // При Aimbot_Range_Silent, чит попадаёт только в голову противника
        public static bool Aimbot_Range_Silent_AutoHeadshot = true;
        
        // При самостоятельном попадании по противнику, чит попадаёт только в голову
        public static bool Aimbot_Range_Manual_AutoHeadshot = true;
        
        #endregion

        #region [Settings] Aimbot Melee
        
        // Если вы держите в руках оружие ближнего боя и враг в радиусе действия, то чит автоматически изуродует врага (даже ручки пачкать не нужно)
        public static bool Aimbot_Melee_Silent = true;
        
        // При Aimbot_Melee_Silent, чит бьёт врага только в голову противника
        public static bool Aimbot_Melee_Silent_AutoHeadshot = true;
        
        // При Aimbot_Melee_Silent, чит бьёт в два раза быстрее
        public static bool Aimbot_Melee_Silent_Fast = true;
        
        // При самостоятельном ударе по противнику, чит выбирает часть тела для удара
        public static bool Aimbot_Melee_Manual = true;
        
        // При самостоятельном ударе по противнику, чит бьёт его только по голове
        public static bool Aimbot_Melee_Manual_AutoHeadshot = true;
        
        #endregion

        #region [Settings] Auto Gather
        
        // Если вы держите в руках инструмент для добычи и ресурс в радиусе действия, то чит автоматически добывает ресурсы
        public static bool AutoGather = true;
        
        // При AutoGather, вы добываете ресурсы в 2 раза быстрее
        public static bool AutoGather_Fast = true;
        
        // При AutoGather, вам не нужно будет искать бонус на руде, чит найдёт его сам и будет ударять по нему
        public static bool AutoGather_Bonus = true;
        
        // При ручной добыче ресурсов, вам не нужно будет искать бонус на руде, чит найдёт его сам и ударят по нему
        public static bool ManualGather_Bonus = true;
        
        #endregion

        #region [Settings] Other

        // Если вы падаете с большой высоты, то чит уменьшает урон от падения до 1 HP 
        public static bool SmallFallDamage = false;
        
        // Друзья, с которыми вы играете
        public static HashSet<UInt64> Friends = new HashSet<UInt64>();

        public static bool UseCustomToken = false;

        public static byte[] CustomToken = {
            242, 187, 166, 103, 4, 35, 83, 138, 194, 185, 105, 55, 66, 231, 225, 155, 12, 61, 94, 148, 62, 176, 239, 10,
            188, 231, 92, 195, 116, 70, 165, 89, 86, 143, 94, 69, 93, 175, 98, 163, 162, 218, 191, 48, 86, 20, 3, 115,
            198, 99, 139, 232, 80, 108, 113, 213, 172, 69, 49, 73, 201, 131, 151, 178, 248, 83, 211, 121, 217, 244, 59,
            158, 192, 176, 107, 58, 156, 79, 106, 200, 141, 113, 169, 27, 4, 216, 17, 49, 239, 80, 230, 6, 72, 216, 114,
            27, 111, 224, 224, 200, 154, 211, 63, 19, 113, 250, 82, 20, 105, 129, 204, 117, 134, 249, 112, 123, 55, 78,
            99, 135, 181, 21, 242, 24, 19, 99, 208, 138, 133, 117, 20, 88, 25, 99, 110, 136, 12, 200, 45, 85, 161, 98,
            108, 188, 120, 33, 63, 190, 235, 69, 60, 103, 83, 78, 205, 231, 184, 93, 145, 14, 212, 131, 143, 91, 154,
            119, 149, 57, 235, 47, 1, 23, 48, 209, 222, 90, 92, 173, 251, 35, 31, 103, 83, 101, 249, 97, 6, 36, 18, 248,
            177, 133, 9, 186, 216, 183, 205, 132, 207, 194, 178, 185, 59, 95, 240, 4, 171, 110, 188, 9, 90, 6, 241, 110,
            126, 105, 99, 30, 192, 65, 211, 232, 76, 232, 210, 131, 214, 34, 28, 137, 122, 201, 192, 98, 215, 98, 249,
            161, 25, 160, 5, 139, 16, 136, 162, 107, 16, 71, 50, 9, 55, 231, 132, 165, 1, 38, 186, 101, 49, 59, 171,
            187, 155, 225, 181, 145, 205, 97, 32, 36, 47, 155, 21, 243, 249, 4, 220, 183, 29, 68, 41, 179, 17, 63, 52,
            190, 218, 148, 143, 230, 239, 229, 168, 77, 45, 89, 92, 248, 247, 210, 88, 220, 50, 111, 61, 10, 211, 152,
            160, 144, 184, 176, 34, 56, 134, 97, 159, 186, 205, 112, 243, 64, 77, 177, 44, 6, 158, 145, 222, 74, 111,
            44, 218, 94, 220, 83, 152, 195, 61, 186, 191, 178, 213, 231, 157, 46, 88, 226, 46, 6, 103, 66, 115, 226, 59,
            186, 62, 81, 172, 109, 181, 177, 116, 140, 169, 228, 178, 204, 70, 35, 80, 90, 46, 231, 115, 55, 14, 236, 3,
            74, 31, 85, 235, 24, 149, 142, 213, 249, 32, 97, 40, 180, 247, 118, 89, 158, 10, 231, 252, 34, 95, 179, 188,
            249, 117, 124, 236, 167, 106, 160, 74, 139, 10, 243, 32, 35, 221, 141, 243, 189, 18, 38, 224, 134, 38, 155,
            55, 128, 161, 141, 20, 134, 49, 148, 13, 181, 119, 155, 215, 116, 87, 110, 16, 252, 21, 130, 5, 49, 186, 99,
            190, 18, 203, 244, 207, 180, 96, 124, 245, 101, 150, 140, 63, 201, 17, 42, 33, 250, 38, 238, 234, 239, 188,
            102, 17, 81, 74, 147, 111, 110, 206, 187, 79, 180, 98, 139, 32, 242, 226, 15, 145, 10, 24, 175, 28, 239, 91,
            238, 187, 224,
        };
        
        #endregion
        

        #region [Settings] Methods

        public static bool IsFriend(UInt64 steamid) => Friends.Contains(steamid);
        
        #endregion
    }
}